FluoTechnology/FLUO_IOT/esp32/boards.txt
menu.DebugLevel=Core Debug Level

##############################################################

fluowifi.name=FLUO WI-FI (ESP)

fluowifi.upload.tool=esptool
fluowifi.upload.maximum_size=1310720
fluowifi.upload.maximum_data_size=294912
fluowifi.upload.wait_for_upload_port=true

fluowifi.serial.disableDTR=true
fluowifi.serial.disableRTS=true

fluowifi.build.mcu=esp32
fluowifi.build.core=esp32
fluowifi.build.variant=fluowifi
fluowifi.build.board=ESP32_DEV


fluowifi.build.f_cpu=240000000L
fluowifi.build.flash_size=4MB
fluowifi.build.flash_freq=40m
fluowifi.build.flash_mode=dio
fluowifi.build.boot=dio
fluowifi.build.partitions=default
fluowifi.upload.speed=115200

fluowifi.menu.DebugLevel.none=None
fluowifi.menu.DebugLevel.none.build.code_debug=0
fluowifi.menu.DebugLevel.error=Error
fluowifi.menu.DebugLevel.error.build.code_debug=1
fluowifi.menu.DebugLevel.warn=Warn
fluowifi.menu.DebugLevel.warn.build.code_debug=2
fluowifi.menu.DebugLevel.info=Info
fluowifi.menu.DebugLevel.info.build.code_debug=3
fluowifi.menu.DebugLevel.debug=Debug
fluowifi.menu.DebugLevel.debug.build.code_debug=4
fluowifi.menu.DebugLevel.verbose=Verbose
fluowifi.menu.DebugLevel.verbose.build.code_debug=5
